In [2]:
import pandas as pd

In [3]:
ser = pd.Series([100,'foo',300,'bar',500],['tom','bob','nancy','dan','eric'])

In [4]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [5]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [6]:
ser[['eric']]

eric    500
dtype: object

In [7]:
ser[['eric']]**2

eric    250000
dtype: object

In [8]:
ser.loc['eric']

500

In [10]:
ser.loc[['eric','bob']]

eric    500
bob     foo
dtype: object

In [11]:
ser[[4,3,1]]

eric    500
dan     bar
bob     foo
dtype: object

In [14]:
ser.iloc[2]

300

In [15]:
ser * 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [16]:
'bob' in ser

True

In [17]:
'bob' not in ser

False

In [19]:
d = {'one':pd.Series([100.,200.,300.], index = ['apple','ball','clock']),
    'two': pd.Series([111.,222.,333.,4444.],index=['apple','ball','cerill','dance'])
}

In [20]:
df = pd.DataFrame(d)
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dance     NaN  4444.0

In [21]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dance'], dtype='object')

In [22]:
df.columns

Index(['one', 'two'], dtype='object')

In [23]:
pd.DataFrame(d, index=['dance','ball','apple'])

         one     two
dance    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [24]:
pd.DataFrame(d,index=['dance','ball','apple'],columns=['two','five'])

          two five
dance  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from list of Python dictionaries</p>

In [26]:
data = [{'alex' : 1, 'joe' : 2}, {'ema': 5, 'dora' : 10, 'alice' : 20}]

In [27]:
pd.DataFrame(data)

   alex  alice  dora  ema  joe
0   1.0    NaN   NaN  NaN  2.0
1   NaN   20.0  10.0  5.0  NaN

In [29]:
pd.DataFrame(data,index=['orange','red'])

        alex  alice  dora  ema  joe
orange   1.0    NaN   NaN  NaN  2.0
red      NaN   20.0  10.0  5.0  NaN

In [30]:
pd.DataFrame(data, columns=['joe','dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Basic DataFrame operations</p>

In [31]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dance     NaN  4444.0

In [32]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dance       NaN
Name: one, dtype: float64

In [33]:
df['two']

apple      111.0
ball       222.0
cerill     333.0
clock        NaN
dance     4444.0
Name: two, dtype: float64

In [35]:
#df['five']

In [36]:
df['three'] = df['one']*df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dance     NaN  4444.0      NaN

In [37]:
df['flag'] = df['one'] > 250

In [38]:
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dance     NaN  4444.0      NaN  False

In [39]:
three = df.pop('three')

In [40]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dance         NaN
Name: three, dtype: float64

In [41]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dance     NaN  4444.0  False

In [42]:
del df['two']

In [43]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dance     NaN  False

In [44]:
df.insert(2,'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dance     NaN  False          NaN

In [45]:
df['one_upper_half'] = df['one'][:2]

In [46]:
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dance     NaN  False          NaN             NaN